HashDefineElectronics/Reflow-O-Matic/Packages/.cache/Keil.Kinetis_KLxx_DFP.1.9.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>Kinetis_KLxx_DFP</name>
  <description>Freescale Kinetis KLxx Series Device Support and Examples</description>

  <releases>
    <release version="1.9.0" date="2015-12-01">
      Device Support:
      - updated MKL82Z7 device support description and files
      - updated KL25Z4 device support description and files
      Examples:
      - added TWR-KL43Z48M Example
      - updated FRDM-KL25Z Example
    </release>
    <release version="1.8.0" date="2015-11-12">
      Device Support:
      - added MKL26Z4      
      - updated MKL82Z7 device support
      - updated MKL device support files
      - updated MK_P128.FLM Flash Algorithm (using Cortex-M4).
      Examples:
      - added FRDM-KL82Z Example
      - added TWR-KL82Z72M Example.
    </release>
    <release version="1.7.0" date="2015-08-12">
      Added device support for MKL28Z7.
    </release>
    <release version="1.6.0" date="2015-05-04">
      Removed FRDM-KL33Z board support.
      Reworked FRDM-KL43Z board support.
    </release>
    <release version="1.5.0" date="2015-04-10">
      Added Device support for MKL13Z32, MKL13Z64, MKL33Z32, MKL33Z64.
      Added board support for FDRM-KL33Z.
      Added missing manuals.
    </release>
    <release version="1.4.0" date="2014-10-08">
      Updated CMSIS files for MKL17Z32, MKL17Z64, MKL27Z32, MKL27Z64.
      Added missing board descriptions.
      Added user manuals for KL17 and KL27 devices
    </release>
    <release version="1.3.0" date="2014-09-24">
      Added KL17, KL27 and KL33 devices
      Update to CMSIS-Core V 1.3 for KL17Z4, KL27Z4, KL33Z4 and KL43Z4
      SRAM range unified into single range
      Added FRDM-KL43Z board examples
    </release>
    <release version="1.2.0" date="2014-07-10">
      Updated KL03 startup file
      Updated KL03 flash algorithm
    </release>
    <release version="1.1.0">
      Updated KL03 CMSIS files
      Added FRDM-KL03Z Blinky example
    </release>
    <release version="1.0.1">
      Updated FRDM-KL25Z\RTX_Blinky example
    </release>
    <release version="1.0.0">
      First Release version of KL Device Family Pack.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>Freescale</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Freescale</keyword>
    <keyword>KL</keyword>
  </keywords>

  <devices>
    <family Dfamily="KLxx Series" Dvendor="Freescale:78">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
      <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
      <book name="Documents\dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
      <description>
Kinetis L series Microcontrollers (MCUs) combine the exceptional low-power performance
with energy-efficiency and ease-of-use of the new ARM Cortex-M0+ processor with
the performance, peripheral sets, enablement and scalability of the Kinetis 32-bit MCU portfolio.
      </description>

      <!-- ******************************  KL0x  ******************************** -->
      <subFamily DsubFamily="KL0x">
        <description>
The Kinetis KL0 family is the entry point into the Kinetis L Series MCUs based on the ARM Cortex-M0+ processor.
The Kinetis KL0 family provides a bridge for 8-bit customers migrating into the Kinetis portfolio and is
software and tool compatible with all other Kinetis L families.
        </description>

        <!-- ******************************  MKL02Z8xxx4  ****************************** -->
        <device Dname="MKL02Z8xxx4">
          <compile header="Device\Include\MKL02Z4.h"  define="MKL02Z8xxx4"/>
          <debug      svd="SVD\MKL02Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFFF00"  size="0x0400"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P8_48MHZ.FLM"    start="0x00000000"  size="0x2000"  RAMstart="0x1FFFFF00"  RAMsize="0x0400"  default="1"/>
          <book name="Documents\KL02P32M48SF0RM.pdf" title="KL02 Sub-Family Reference Manual"/>
          <book name="Documents\KL02P32M48SF0.pdf"   title="KL02 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL02Z16xxx4  ****************************** -->
        <device Dname="MKL02Z16xxx4">
          <compile header="Device\Include\MKL02Z4.h"  define="MKL02Z16xxx4"/>
          <debug      svd="SVD\MKL02Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFFE00"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P16_48MHZ.FLM"   start="0x00000000"  size="0x4000"  RAMstart="0x1FFFFE00"  RAMsize="0x0800"  default="1"/>
          <book name="Documents\KL02P32M48SF0RM.pdf" title="KL02 Sub-Family Reference Manual"/>
          <book name="Documents\KL02P32M48SF0.pdf"   title="KL02 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL02Z32xxx4  ****************************** -->
        <device Dname="MKL02Z32xxx4">
          <compile header="Device\Include\MKL02Z4.h"  define="MKL02Z32xxx4"/>
          <debug      svd="SVD\MKL02Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFFC00"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P32_48MHZ.FLM"   start="0x00000000"  size="0x8000"  RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>
          <book name="Documents\KL02P32M48SF0RM.pdf" title="KL02 Sub-Family Reference Manual"/>
          <book name="Documents\KL02P32M48SF0.pdf"   title="KL02 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL03Z8xxx4  ****************************** -->
        <device Dname="MKL03Z8xxx4">
          <compile header="Device\Include\MKL03Z4.h"  define="MKL03Z8xxx4"/>
          <debug      svd="SVD\MKL03Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFFE00"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P8_48MHZ_KL03.FLM"   start="0x00000000"  size="0x2000"  RAMstart="0x1FFFFE00"  RAMsize="0x800"  default="1"/>
          <book name="Documents\KL03P24M48SF0RM.pdf" title="KL03 Sub-Family Reference Manual"/>
          <book name="Documents\KL03P24M48SF0.pdf"   title="KL03 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL03Z16xxx4  ****************************** -->
        <device Dname="MKL03Z16xxx4">
          <compile header="Device\Include\MKL03Z4.h"  define="MKL03Z16xxx4"/>
          <debug      svd="SVD\MKL03Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFFE00"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P16_48MHZ_KL03.FLM"   start="0x00000000"  size="0x4000"  RAMstart="0x1FFFFE00"  RAMsize="0x800"  default="1"/>
          <book name="Documents\KL03P24M48SF0RM.pdf" title="KL03 Sub-Family Reference Manual"/>
          <book name="Documents\KL03P24M48SF0.pdf"   title="KL03 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL03Z32xxx4  ****************************** -->
        <device Dname="MKL03Z32xxx4">
          <compile header="Device\Include\MKL03Z4.h"  define="MKL03Z32xxx4"/>
          <debug      svd="SVD\MKL03Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFFE00"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P32_48MHZ_KL03.FLM"   start="0x00000000"  size="0x8000"  RAMstart="0x1FFFFE00"  RAMsize="0x800"  default="1"/>
          <book name="Documents\KL03P24M48SF0RM.pdf" title="KL03 Sub-Family Reference Manual"/>
          <book name="Documents\KL03P24M48SF0.pdf"   title="KL03 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL04Z8xxx4  ****************************** -->
        <device Dname="MKL04Z8xxx4">
          <compile header="Device\Include\MKL04Z4.h"  define="MKL04Z8xxx4"/>
          <debug      svd="SVD\MKL04Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFFF00"  size="0x0400"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P8_48MHZ.FLM"    start="0x00000000"  size="0x2000"  RAMstart="0x1FFFFF00"  RAMsize="0x0400"  default="1"/>
          <book name="Documents\KL04P48M48SF1RM.pdf" title="KL04 Sub-Family Reference Manual"/>
          <book name="Documents\KL04P48M48SF1.pdf"   title="KL04 Sub-Family Data Sheet"/>
        </device>

